<template>
  <section class="bg-white py-24">
  <div class="container mx-auto">
    <div class="technologies grid grid-cols-3 gap-x-8 gap-y-4">        
        <TechnologiesTechnologiTop :tech="tech"/>        
    </div>
    <div class="technologies grid grid-cols-3 gap-x-8 gap-y-4 pt-48">    
    <TechnologiesTexnologiBottom :projects="projects"/>
    </div>
  </div>
  </section>
</template>

<script setup>
const tech = ref([
  {id:1,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title:'Здравоохранение'},
  {id:2,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Транспорт'},
  {id:3,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Образование'},
  {id:4,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Правоохранительные органы'},
  {id:5,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Государственные учреждения'},
  {id:6,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Спортивные объекты'},
  {id:7,name:"Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования",title: 'Судебная система'},
])

const projects = ref([
  {id:1,title:'Автоматизация контакт-центра',text:'Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования'},
  {id:2,title:'Анализ взаимрдействия клинет-сотрудник',text:'Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования'},
  {id:3,title:'Анализация контакт-центра',text:'Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования'},
  {id:4,title:'Анализ взаимрдействия клинет-сотрудник',text:'Господа, реализация намеченных плановых заданий говорит о возможностях новых принципов формирования'},
])


</script>
